waveonly/wavemakerBased/IrregularWaves/I14_0deg/0.orig/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    waveMaker
    {
       type            movingWallVelocity;
       value           uniform (0 0 0);

    }

    walls
    {
       type            empty;
    }
    bottom
    {
        type            slip;
    }
    outlet
    {
        type            waveAbsorption2DVelocity;
        uCurrent        (0. 0. 0.);
        value           uniform (0 0 0);
    }

    atmosphere
    {
        type            pressureInletOutletVelocity;
        value           uniform (0 0 0);
    }
    floater
    {
        type            rigidBodySlipVelocity;
        value           uniform (0 0 0);
    }
}

// ************************************************************************* //
