waveonly/wavemakerBased/IrregularWaves/I14_0deg/constant/wavemakerMovementDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \    /   O peration     | Version:  v2212                                     |
|   \  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant/";
    object      waveDict;
}
//---------------------------------------------------------------------------*//

wavemakerType   Flap;
nPaddles   1;
genAbs          1;
hingeHeight    -1.500000;

timeSeries 16501(
0.000000
0.100000
0.200000
0.300000
0.400000
0.500000
0.600000
0.700000
0.800000
0.900000
1.000000
1.100000
1.200000
1.300000
1.400000
1.500000
1.600000
1.700000
1.800000
1.900000
2.000000
2.100000
2.200000
2.300000
2.400000
2.500000
2.600000
2.700000
2.800000
2.900000
3.000000
3.100000
3.200000
3.300000
3.400000
3.500000
3.600000
3.700000
3.800000
3.900000
4.000000
4.100000
4.200000
4.300000
4.400000
4.500000
4.600000
4.700000
4.800000
4.900000
5.000000
5.100000
5.200000
5.300000
5.400000
5.500000
5.600000
5.700000
5.800000
5.900000
6.000000
6.100000
6.200000
6.300000
6.400000
6.500000
6.600000
6.700000
6.800000
6.900000
7.000000
7.100000
7.200000
7.300000
7.400000
7.500000
7.600000
7.700000
7.800000
7.900000
8.000000
8.100000
8.200000
8.300000
8.400000
8.500000
8.600000
8.700000
8.800000
8.900000
9.000000
9.100000
9.200000
9.300000
9.400000
9.500000
9.600000
9.700000
9.800000
9.900000
...
);

paddleTilt 1(
16501(
0.000000
0.047958
0.066575
0.051073
0.025017
0.021666
0.037237
0.036081
0.001950
-0.055617
-0.142960
-0.280309
-0.454893
-0.628329
-0.795595
-0.976984
-1.137329
-1.175108
-1.020749
-0.700492
-0.282900
0.189300
0.689251
1.170220
1.567850
1.818285
1.876878
1.754550
1.528240
1.273254
0.995037
0.664329
0.284702
-0.130951
-0.601661
-1.109239
-1.528166
-1.724338
-1.692572
-1.505627
-1.192808
-0.800946
-0.499438
-0.426978
-0.461460
-0.348696
-0.057923
0.201841
0.355640
0.525420
0.736831
0.815159
0.654360
0.371338
0.101253
-0.166884
-0.458169
-0.692399
-0.780396
-0.673236
-0.266120
0.522822
1.480535
2.132966
2.191497
1.784887
1.160689
0.417280
-0.309893
-0.700966
-0.603602
-0.348603
-0.385306
-0.697061
-0.881965
-0.750018
-0.524902
-0.452896
-0.511480
-0.581053
-0.668691
-0.844537
-1.094280
-1.311969
-1.352879
-1.092594
-0.558456
-0.003197
0.291065
0.301556
0.250583
0.328650
0.576459
1.014544
1.683595
2.494276
3.189920
3.534635
3.444243
...
);
