waveonly/wavemakerBased/IrregularWaves/I14_0deg/system/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

beach1
{
    type            explicitPorositySource;

    explicitPorositySourceCoeffs
    {
        selectionMode   cellZone;
        cellZone        absorber;

        type            DarcyForchheimer;

        d   (10000 10000 10000);
        f   (10 10 10);

        coordinateSystem
        {
            type    cartesian;
            origin  (0 0 0);
            rotation
            {
                type    axes;
                e1  (1 0 0);
                e2  (0 0 1);
            }
        }
    }
}

//************************************************************************* //
